# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с
# повторениями). Выдать без повторений в порядке возрастания все те числа, которые
# встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
# элементов второго множества. Затем пользователь вводит сами элементы множеств.

# 11 6 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18

# 6 12

from random import randint

# a = {11, 6, 2, 4, 6, 8, 10, 12, 10, 8, 6, 4, 2}
# b = {3, 6, 9, 12, 15, 18}

a = int(input('Введите количество элементов первого множества: '))
b = int(input('Введите количество элементов второго множества: '))

number_set_1 = []                           # Создаем списки, т.к. по условию задачи (может быть, с повторениями)
number_set_2 = []                                               

for i in range(a):
    number_set_1.append(randint(1, 20))     # Заполняем список1 рандомными значениями

for i in range(b):
    number_set_2.append(randint(1, 20))     # Заполняем список1 рандомными значениями

print(f'{number_set_1},\n{number_set_2}')   # Выводим списки на экран


number_set_1 = set(number_set_1)            # Меняем тип коллекции со списка на множество
number_set_2 = set(number_set_2)            

result = number_set_1.intersection(number_set_2)  # Используем метод intersection() пересечения множеств
result = sorted(result)                           # Используем метод sorted()
print(result)